#   Арсенал героя 2.0
#   Демонстрирует работу с кортежами
#   создадим кортеж с несколькими элементами и выведем его с помощью цикла for

inventory = ("меч",
             "кольчуга",
             "щит",
             "целебное снадобье")
print("\nИтак, в вашем арсенале:")
for item in inventory:
    print(item)
print("Сейчас в вашем распоряжении", len(inventory), "предмета/-ов.")
if "целебное снадобье" in inventory:
    print("Вы еще поживете и повоюете.")
index = int(input("\nВведите индекс одного из предметов арсенала: "))
print("Под индексом", index, "в арсенале находится", inventory[index])
start = int(input("\nВведите начальный индекс среза: "))
finish = int(input("Введите конечный индекс среза: "))
print("Срез inventory[", start, ":", finish, "] - это", end=" ")
print(inventory[start:finish])
chest = ("золото", "драгоценные камни")
print("Вы нашли ларец. Вот что в нем есть:[", chest, "]")
print("Вы приобщили содержимое ларца к своему арсеналу.")
inventory += chest
print("Теперь в вашем распоряжении:", inventory)
input("\n\nНажмите Enter, чтобы выйти.")

