#   Анаграммы (Word Jumble)
#   Компьютер выбирает какое-либо слово и хаотически переставляет его буквы
#   Задача игрока - восстановить исходное слово
import random

print("""Добро пожаловать в игру 'Анаграммы!'
Надо переставить буквы так, чтобы получилось осмысленное слово.
(Для выхода нажмите Enter, не вводя своей версии.)\n""")
jumble: str = "s"
print("Вот анаграмма: %s\n" % jumble)
guess = str(input("Попробуйте отгадать исходное слово: "))
