#   Рантье (версия с ошибкой)
#   Демонстрирует преобразование типов
print("\t\tРантье")

print("""Программа подсчитывает ваши ежемесячные расходы. Эту статистику нужно 
знать затем, чтобы у вас не кончились деньги и вам не пришлось искать работу.""")

print("""Введите суммы расходов по всем статьям, перечисленным ниже. Вы богаты - 
так не мелочитесь, пишите суммы в долларах, без центов.""")

car = int(input("Техническое обслуживание машины 'Ламборгини': "))
rent = int(input("Съём роскошной квартиры на Манхэттене: "))
plane = int(input("Аренда самолёта: "))
gifts = int(input("Подарки: "))
lunchs = int(input("Обеды и званые ужины в ресторанах: "))
slaves = int(input("Жалованье прислуги (дворецкий, повар, водитель, секретарь): "))
psycho = int(input("Плата личному психоаналитику: "))
games = int(input("Компьютерные игры: "))


sum = car + rent + plane + gifts + lunchs + slaves + psycho + games
print("Общая сумма: %d" % sum)


input("\n\nHaжмитe Enter, чтобы выйти.")
