#     Бесполезные факты
#     Узнает у пользователя его / её личные данные и выдает несколько фактов
#     о нем / ней. Эти факты истинны, но совершенно бесполезны.

name: str = input("Привет. Как тебя зовут? ")
age = int(input("Сколько тебе лет? "))
weight = int(input("Хорошо, и последний вопрос. Сколько в тебе килограммов? "))
print("\nЕсли бы поэт Каммингс адресовал тебе письмо, он бы обратился к тебе так: " + name.lower())
print("А если бы это был рехнувшийся Каммингс, то так: " + name.upper())
print("""\nЕсли бы маленький ребенок решил привлечь твое внимание
он бы произнес твое имя так:"""
      , name * 5)

current_age: int = age * (365*24*60*60)  # dd:hh:mm:ss
print("Твой нынешний возраст - свыше %d секунд" % current_age)
print("Знаете ли вы, что на Луне вы весили бы всего " + str(weight / 6) + " кг?")
print("А вот находясь на Солнце, вы бы весили " + str(weight * 27.1) + " кг. (Но, увы, это продолжалось бы недолго...)")
input("\n\nНажмите Enter, чтобы выйти.")
