#   Переводчик с гигского на русский
#   Демонстрирует использование словарей

geek = {"404": "Не знать, не владеть информацией. От сообщения об ошибке 404 'Странице не найдена'.",
        "Googling": "'Гугление', поиск в Сети сведений о ком-либо",
        "Keyboard Plague": "Мусор, который скапливается в клавиатуре компьютера.",
        "Link Rot": "Процесс устаревания гиперссылок на веб-страницах.",
        "Percussive Maintenance": "О ситуации, когда кто-либо бьет по корпусу неисправного электронного прибора в надежде восстановить его работу.",
        "Unistalled": "Об увольнении кого-либо. Особенно популярно на рубеде 1990-2000-х годов."}

choice = None
while choice != "0":
    print(
        """
        Переводчик с гикского на русский
        0 - Выйти
        1 - Найти толкование термина
        2 - Добавить термин
        3 - Изменить толкование
        4 - Удалить термин
        """
    )
    choice = input("Ваш выбор: \n")
    if choice == "0":
        print("До свидания.")
    elif choice == "1":
        term = input("Какой термин вы хотите перевести с гикского на русский? ")
        if term in geek:
            definition = geek[term]
            print("\n", term, "означает", definition)
        else:
            print("\nУвы, этот термин мне незнаком:", term)
    elif choice == "2":
        term = input("Какой термин гикского языка вы хотите добавить? ")
        if term not in geek:
            definition = input("\nВпишите ваше толкование: ")
            geek[term] = definition
            print("\nТермин", term, "добавлен в словарь")
        else:
            print("\nУвы, этот термин мне незнаком:", term)
    elif choice == "3":
        term = input("Какой термин вы хотите переопределить? ")
        if term in geek:
            definition = input("Впишите ваше толкование: ")
            geek[term] = definition
            print("\nТермин", term, "переопределен.")
        else:
            print("\nТакого термина пока нет! Попробуйте добавить его в словарь.")
    elif choice == "4":
        term = input("Какой термин вы хотите удалить? ")
        if term in geek:
            del geek[term]
            print("\nТермин", term, "удален.")
        else:
            print("\nНичем не могу помочь. Термина", term, "нет в словаре")
    else:
        print("Извините, в меню нет пункта", choice)

input("\n\nHaжмитe Enter. чтобы выйти.")

