#   Арсенал героя 3.0
#   Демонстрирует работу со списками
#   создадим список с несколькими элементами и выведем его с помощью цикла for

inventory = ["меч", "кольчуга", "щит", "целебное снадобье"]

print("\nИтак, в вашем арсенале: ")
for item in inventory:
    print(item)

print("Сейчас в вашем распоряжении", len(inventory), "предмета/ов.")  # найдем длину списка

if "целебное снадобье" in inventory:
    print("Вы еще поживете и повоюете")

index = int(input("\nВведите индекс одного из предметов арсенала: "))
print("Под индексом", index, "в арсенале находится", inventory[index])

start = int(input("\nВведите начальный элемент среза: "))  # отобразим срез
finish = int(input("Введите конечный элемент среза: "))
print("Срез inventory[", start, ":", finish, "] - это", end=" ")
print(inventory[start:finish])

chest = ["золото", "драгоценные камни"]  # соединим два списка
print("Вы нашли ларец. Вот что в нем есть: ", chest)
print("Вы приобщили содержимое ларца к своему арсеналу.")
inventory += chest
print("Теперь в вашем распоряжении: ", inventory)

print("Вы обменяли меч на арбалет.")  # присваивем значение элементу по индексу
inventory[0] = "арбалет"
print("Теперь ваш арсенал содержит следующие предметы: ", inventory)

print("За золото и драгоценные камни вы купили магический кристалл, способный предсказывать будущее.")  # приписываем значение элементам по срезу индексов
inventory[4:6] = ["магический кристалл"]
print("Теперь в вашем распоряжении: ", inventory)

print("В тяжелом бою был раздроблен ваш щит.")  # удаляем элемент
del inventory[2]
print("Вот что осталось в арсенале: ", inventory)

print("Воры лишили вам арбалета и кольчуги.")  # удаляем срез
del inventory[:2]
print("В арсенале теперь только: ", inventory)

input("\n\nHaжмитe Enter. чтобы выйти.")
