#   Проигранное сражение
#   Демонстрирует тот самый ненавистный нам бесконечный цикл

print("""Вашего героя окружила огромная армия троллей.
Смрадными зелёными трупами врагов устланы все окрестные поля.
Одинокий герой достает меч из ножен, готовясь к последней битве в своей жизни.\n""")
health: int = 10
trolls: int = 0
damage: int = 3
while health > 0:
    trolls += 1
    health -= damage
    print("""Взмахнув мечом, ваш герой истребляет злобного тролля,
    но сам получает повреждений на %d очков.\n""" % damage)
print("Ваш герой доблестно сражался и убил %d троллей." % trolls)
print("Но увы! Он пал на поле боя.")
input("\n\nHaжмитe Enter. чтобы выйти.")