#   Компьютерный датчик настроения
#   Демонстрирует работу elif

import random
print("Я ощущаю вашу энергетику. От моего экрана не скрыто ни одно из ваших чувств.")
print("Итак, ваше настроение...")
mood = random.randint(1, 3)
if mood == 1: #радостное
    print(":)")
elif mood == 2: #так себе
    print(":/")
elif mood ==3: #прескверное
    print(":(")
else:
    print("Не бывает такого настроения! (Должно быть, вы совершенно не в себе.)")
print("...Но это только сегодня.")
input("\n\nHaжмитe Enter. чтобы выйти.")

