#   Симулятор пирожка с "сюрпризом"
import random

surprise: int = random.randint(1, 5)
if surprise == 1:
    print("Сегодня у вас будет хороший день. Если только не повторится ситуация из первой серии 'Dead like me'")
elif surprise == 2:
    print("Ну-у-у-у-у. Такое. Купите ещё пироженку, тогда и поговорим.")
elif surprise == 3:
    print("У-у-у, вы вдвоем едите один пирожок. Надеюсь, вы разнополые существа...")
elif surprise == 4:
    print("Так, ты пироженку не заслужил. Сбегай за гороховым супом.")
elif surprise == 5:
    print("После этой попробоуй пироженку со сгущенкой!")
input("\n\nHaжмитe Enter. чтобы выйти.")
